In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-1.1.1-cp36-cp36m-manylinux1_x86_64.whl (10.5 MB)
     |████████████████████████████████| 10.5 MB 1.3 MB/s
Requirement already satisfied: pytz>=2017.2 in /usr/lib/python3/dist-packages (from pandas) (2018.3)
Requirement already satisfied: numpy>=1.15.4 in /home/amogha/.local/lib/python3.6/site-packages (from pandas) (1.19.0)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/amogha/.local/lib/python3.6/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /home/amogha/.local/lib/python3.6/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pandas
Successfully installed pandas-1.1.1
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [1]:
import numpy as np 
import pandas as pd

In [2]:
randn=np.random.rand

In [3]:
data={'red':[1,2,3,4],'yellow':[3,6,8,3]} #creating a dataframe

df=pd.DataFrame(data)
df

   red  yellow
0    1       3
1    2       6
2    3       8
3    4       3

In [5]:
#giving index
df=pd.DataFrame(data,index=['jan','feb','march','april'])
df

       red  yellow
jan      1       3
feb      2       6
march    3       8
april    4       3

In [6]:
df.loc['feb'] #locate a particular value by the name of index

red       2
yellow    6
Name: feb, dtype: int64

In [7]:
df=pd.read_csv("test.csv") #reading csv files

In [9]:
df.head() #prints out the first 5 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
df=pd.read_csv('test.csv',index_col=0)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
df.tail(2) #viewing last 2 rows

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 55.9+ KB

In [15]:
df.shape #outputs the tuple of rows and columns

(418, 10)

In [17]:
temp_df=df.append(df) #append will return a copy without affecting original df
temp_df.shape

(836, 10)

In [18]:
#dropping duplicates
temp_df=temp_df.drop_duplicates()
temp_df.shape

(418, 10)

In [19]:
df.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [20]:
df.rename(columns={'Embarked':'embarked'},inplace=True) #renaming the column name 
df.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'embarked'],
      dtype='object')

In [21]:
df.isnull() #returns a df where each cell is true of false depending on its null value

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,embarked
PassengerId,,,,,,,,,,
892,False,False,False,False,False,False,False,False,True,False
893,False,False,False,False,False,False,False,False,True,False
894,False,False,False,False,False,False,False,False,True,False
895,False,False,False,False,False,False,False,False,True,False
896,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...
1305,False,False,False,True,False,False,False,False,True,False
1306,False,False,False,False,False,False,False,False,False,False
1307,False,False,False,False,False,False,False,False,True,False
1308,False,False,False,True,False,False,False,False,True,False
1309,False,False,False,True,False,False,False,False,True,False

In [22]:
df.isnull().sum() #count the no. of each column

Pclass        0
Name          0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
embarked      0
dtype: int64

In [25]:
df.dropna(axis=1) #removing all the nulls

,Pclass,Name,Sex,SibSp,Parch,Ticket,embarked
PassengerId,,,,,,,
892,3,"Kelly, Mr. James",male,0,0,330911,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,1,0,363272,S
894,2,"Myles, Mr. Thomas Francis",male,0,0,240276,Q
895,3,"Wirz, Mr. Albert",male,0,0,315154,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1,1,3101298,S
...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,0,0,A.5. 3236,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,0,0,PC 17758,C
1307,3,"Saether, Mr. Simon Sivertsen",male,0,0,SOTON/O.Q. 3101262,S
1308,3,"Ware, Mr. Frederick",male,0,0,359309,S
1309,3,"Peter, Master. Michael J",male,1,1,2668,C

In [31]:
df.mean()

Pclass     2.265550
Age       30.272590
SibSp      0.447368
Parch      0.392344
Fare      35.627188
dtype: float64

In [32]:
df['Pclass'].describe()

count    418.000000
mean       2.265550
std        0.841838
min        1.000000
25%        1.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

In [33]:
df.corr()

          Pclass       Age     SibSp     Parch      Fare
Pclass  1.000000 -0.492143  0.001087  0.018721 -0.577147
Age    -0.492143  1.000000 -0.091587 -0.061249  0.337932
SibSp   0.001087 -0.091587  1.000000  0.306895  0.171539
Parch   0.018721 -0.061249  0.306895  1.000000  0.230046
Fare   -0.577147  0.337932  0.171539  0.230046  1.000000

In [35]:
pclasscol=df['Pclass']
type(pclasscol)

pandas.core.series.Series

In [36]:
pclasscol=df[['Pclass']]
type(pclasscol)

pandas.core.frame.DataFrame

In [38]:
p=df.iloc[1] #gives numerical index
p

Pclass                                     3
Name        Wilkes, Mrs. James (Ellen Needs)
Sex                                   female
Age                                       47
SibSp                                      1
Parch                                      0
Ticket                                363272
Fare                                       7
Cabin                                    NaN
embarked                                   S
Name: 893, dtype: object

In [42]:
df_subset=df.iloc[1:4]
df_subset

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,embarked
PassengerId,,,,,,,,,,
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S

In [43]:
condition=(df['Sex']=='female')
condition.head()

PassengerId
892    False
893     True
894    False
895    False
896     True
Name: Sex, dtype: bool

In [47]:
def pclass_function(x): 
    if x>2:
        return 'good'
    else:
        return 'bad'

df['Pclass_category']=df['Pclass'].apply(pclass_function) #using apply() function to apply a function to df
df['Pclass_category'].head(3)

PassengerId
892    good
893    good
894     bad
Name: Pclass_category, dtype: object